{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "batch_input_shape": [null, 32, null, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "relu0", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "pooling0", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "relu1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "pooling1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnorm2", "trainable": true, "axis": 3, "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "relu2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "relu3", "trainable": true, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[0, 0], [1, 1]], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "pooling2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv4", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnorm4", "trainable": true, "axis": 3, "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "relu4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv5", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "relu5", "trainable": true, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[0, 0], [1, 1]], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "pooling3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv6", "trainable": true, "filters": 512, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnorm6", "trainable": true, "axis": 3, "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "relu6", "trainable": true, "activation": "relu"}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [-1, 512]}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 136, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batchnorm2/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.8833943009376526, "scale": 0.0010609872200909782, "dtype": "uint8"}}, {"name": "batchnorm2/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.18798887729644775, "scale": 0.0005702551235170926, "dtype": "uint8"}}, {"name": "batchnorm2/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.2525344315697165, "scale": 0.0027154239953732957, "dtype": "uint8"}}, {"name": "batchnorm2/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.0036715995520353317, "scale": 0.000176158320962214, "dtype": "uint8"}}, {"name": "batchnorm4/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.8430139422416687, "scale": 0.001338507848627427, "dtype": "uint8"}}, {"name": "batchnorm4/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.19313299655914307, "scale": 0.0006774922504144557, "dtype": "uint8"}}, {"name": "batchnorm4/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -1.2389175723580752, "scale": 0.013920422161326688, "dtype": "uint8"}}, {"name": "batchnorm4/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 1.1855401992797852, "scale": 0.0214022112827675, "dtype": "uint8"}}, {"name": "batchnorm6/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.9509140253067017, "scale": 0.0008737886653226965, "dtype": "uint8"}}, {"name": "batchnorm6/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.08449174390704024, "scale": 0.0004182759599358428, "dtype": "uint8"}}, {"name": "batchnorm6/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -2.5104655826793, "scale": 0.017679335089290843, "dtype": "uint8"}}, {"name": "batchnorm6/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 4.143547058105469, "scale": 0.042258079379212624, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [512, 256], "dtype": "float32", "quantization": {"min": -0.2906681444130692, "scale": 0.002505759865629907, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.5016659591712204, "scale": 0.00377192450504677, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.22302980422973634, "scale": 0.00218656670813467, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [512, 256], "dtype": "float32", "quantization": {"min": -0.3017654934350182, "scale": 0.002670491092345294, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.7233366627319187, "scale": 0.005521653913984112, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.2653205714973749, "scale": 0.0020891383582470465, "dtype": "uint8"}}, {"name": "bidirectional_2/forward_lstm_2/kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.6377722831333384, "scale": 0.0047242391343210255, "dtype": "uint8"}}, {"name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.45559045321801134, "scale": 0.0043389566973143934, "dtype": "uint8"}}, {"name": "bidirectional_2/forward_lstm_2/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.3836315489282795, "scale": 0.0037983321676067277, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_2/kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.5677861234721016, "scale": 0.00440144281761319, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.4923460371354047, "scale": 0.0039705325575435865, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_2/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.357279580597784, "scale": 0.0037608376905029894, "dtype": "uint8"}}, {"name": "conv0/kernel", "shape": [3, 3, 1, 64], "dtype": "float32", "quantization": {"min": -0.17229650978948557, "scale": 0.0013152405327441646, "dtype": "uint8"}}, {"name": "conv0/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.31004128280807947, "scale": 0.0019138350790622188, "dtype": "uint8"}}, {"name": "conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.2894618812729331, "scale": 0.001982615625157076, "dtype": "uint8"}}, {"name": "conv1/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.05753084722102857, "scale": 0.00047546154728122787, "dtype": "uint8"}}, {"name": "conv2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.2334712427036435, "scale": 0.0016441636810115739, "dtype": "uint8"}}, {"name": "conv2/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.06696086449950349, "scale": 0.00133921728999007, "dtype": "uint8"}}, {"name": "conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.24894541198132086, "scale": 0.0017909741869159774, "dtype": "uint8"}}, {"name": "conv3/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.05588440575143871, "scale": 0.0005222841659012963, "dtype": "uint8"}}, {"name": "conv4/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.22953233502659146, "scale": 0.001995933348057317, "dtype": "uint8"}}, {"name": "conv4/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.09326723217964172, "scale": 0.0008076964640149883, "dtype": "uint8"}}, {"name": "conv5/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.25815431387985455, "scale": 0.0018308816587223726, "dtype": "uint8"}}, {"name": "conv5/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.04655844148467569, "scale": 0.0004655844148467569, "dtype": "uint8"}}, {"name": "conv6/kernel", "shape": [2, 2, 512, 512], "dtype": "float32", "quantization": {"min": -0.2260791689157486, "scale": 0.001899824948871837, "dtype": "uint8"}}, {"name": "conv6/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.00904921256005764, "scale": 0.0006585234885706621, "dtype": "uint8"}}, {"name": "time_distributed_1/kernel", "shape": [128, 64], "dtype": "float32", "quantization": {"min": -0.5058045499465045, "scale": 0.0038318526511098823, "dtype": "uint8"}}, {"name": "time_distributed_1/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.11497577393756193, "scale": 0.0008710285904360753, "dtype": "uint8"}}, {"name": "time_distributed_2/kernel", "shape": [128, 136], "dtype": "float32", "quantization": {"min": -1.2728320332134473, "scale": 0.010348227912304449, "dtype": "uint8"}}, {"name": "time_distributed_2/bias", "shape": [136], "dtype": "float32", "quantization": {"min": -0.5935114300718494, "scale": 0.0028811234469507253, "dtype": "uint8"}}]}]}